food = str(input("Введите категорию: ")).strip().lower()

match food: 
    case "напиток": 
        print("Чай", "Кофе", "Сок")
    case "суп": 
        print("Борщ", "Щи", "Суп-пюре")
    case "десерт":
        print("Торт", "Мороженое", "Фрукты")
    case _:
        print("Данной категории нет")
        exit()

dish = input("Введите название блюда: ").strip().lower()


match (food, dish):
    case ("напиток", "чай"):
        print(f"Цена '{dish}': 100 рублей.")
    case ("напиток", "кофе"):
        print(f"Цена '{dish}': 150 рублей.")
    case ("напиток", "сок"):
        print(f"Цена '{dish}': 120 рублей.")
    case ("суп", "борщ"):
        print(f"Цена '{dish}': 250 рублей.")
    case ("суп", "щи"):
        print(f"Цена '{dish}': 200 рублей.")
    case ("суп", "суп-пюре"):
        print(f"Цена '{dish}': 230 рублей.")
    case ("десерт", "торт"):
        print(f"Цена '{dish}': 180 рублей.")
    case ("десерт", "мороженое"):
        print(f"Цена '{dish}': 130 рублей.")
    case ("десерт", "фрукты"):
        print(f"Цена '{dish}': 160 рублей.")
    case _:
        print("К сожалению, этого блюда нет в прайс-листе.")